# SQL Assessment by Fidel Chan

## Enabling SQLite for Jupyter Notebook

In [1]:
%load_ext sql

In [2]:
%sql sqlite://

'Connected: None@None'

# SQL Movie-Rating Query Exercises

## Creating the Tables of Movie, Reviewer and Rating

In [3]:
%%sql
/* Create the schema for our tables */
create table Movie(mID int, title text, year int, director text);
create table Reviewer(rID int, name text);
create table Rating(rID int, mID int, stars int, ratingDate date);

/* Populate the tables with our data */
insert into Movie values(101, 'Gone with the Wind', 1939, 'Victor Fleming');
insert into Movie values(102, 'Star Wars', 1977, 'George Lucas');
insert into Movie values(103, 'The Sound of Music', 1965, 'Robert Wise');
insert into Movie values(104, 'E.T.', 1982, 'Steven Spielberg');
insert into Movie values(105, 'Titanic', 1997, 'James Cameron');
insert into Movie values(106, 'Snow White', 1937, null);
insert into Movie values(107, 'Avatar', 2009, 'James Cameron');
insert into Movie values(108, 'Raiders of the Lost Ark', 1981, 'Steven Spielberg');

insert into Reviewer values(201, 'Sarah Martinez');
insert into Reviewer values(202, 'Daniel Lewis');
insert into Reviewer values(203, 'Brittany Harris');
insert into Reviewer values(204, 'Mike Anderson');
insert into Reviewer values(205, 'Chris Jackson');
insert into Reviewer values(206, 'Elizabeth Thomas');
insert into Reviewer values(207, 'James Cameron');
insert into Reviewer values(208, 'Ashley White');

insert into Rating values(201, 101, 2, '2011-01-22');
insert into Rating values(201, 101, 4, '2011-01-27');
insert into Rating values(202, 106, 4, null);
insert into Rating values(203, 103, 2, '2011-01-20');
insert into Rating values(203, 108, 4, '2011-01-12');
insert into Rating values(203, 108, 2, '2011-01-30');
insert into Rating values(204, 101, 3, '2011-01-09');
insert into Rating values(205, 103, 3, '2011-01-27');
insert into Rating values(205, 104, 2, '2011-01-22');
insert into Rating values(205, 108, 4, null);
insert into Rating values(206, 107, 3, '2011-01-15');
insert into Rating values(206, 106, 5, '2011-01-19');
insert into Rating values(207, 107, 5, '2011-01-20');
insert into Rating values(208, 104, 3, '2011-01-02');

Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

## Find the titles of all movies directed by Steven Spielberg.

In [4]:
%%sql
SELECT title 
FROM Movie 
WHERE director = "Steven Spielberg";

Done.

[(u'E.T.',), (u'Raiders of the Lost Ark',)]

## Find all years that have a movie that received a rating of 4 or 5, and sort them in increasing order.

In [5]:
%%sql
SELECT DISTINCT year
FROM Movie
INNER JOIN Rating on Movie.mID = Rating.mID
WHERE stars >= 4
ORDER BY year ASC;

Done.

[(1937,), (1939,), (1981,), (2009,)]

## Find the titles of all movies that have no ratings.

In [6]:
%%sql
SELECT title
FROM Movie
LEFT JOIN Rating on Movie.mID = Rating.mID
WHERE stars IS NULL;

Done.

[(u'Star Wars',), (u'Titanic',)]

## Some reviewers didn't provide a date with their rating. Find the names of all reviewers who have ratings with a NULL value for the date.

In [7]:
%%sql
Select name
FROM Reviewer
INNER JOIN Rating on Reviewer.rID = Rating.rID
WHERE ratingDate IS NULL;

Done.

[(u'Daniel Lewis',), (u'Chris Jackson',)]

## Write a query to return the ratings data in a more readable format: reviewer name, movie title, stars, and ratingDate. Also, sort the data, first by reviewer name, then by movie title, and lastly by number of stars.

In [8]:
%%sql
Select name, Movie.title, stars, ratingDate
FROM Reviewer
INNER JOIN Rating on Reviewer.rID = Rating.rID
INNER JOIN Movie on Rating.mID = Movie.mID
ORDER BY name, title, stars ASC;

Done.

[(u'Ashley White', u'E.T.', 3, u'2011-01-02'),
 (u'Brittany Harris', u'Raiders of the Lost Ark', 2, u'2011-01-30'),
 (u'Brittany Harris', u'Raiders of the Lost Ark', 4, u'2011-01-12'),
 (u'Brittany Harris', u'The Sound of Music', 2, u'2011-01-20'),
 (u'Chris Jackson', u'E.T.', 2, u'2011-01-22'),
 (u'Chris Jackson', u'Raiders of the Lost Ark', 4, None),
 (u'Chris Jackson', u'The Sound of Music', 3, u'2011-01-27'),
 (u'Daniel Lewis', u'Snow White', 4, None),
 (u'Elizabeth Thomas', u'Avatar', 3, u'2011-01-15'),
 (u'Elizabeth Thomas', u'Snow White', 5, u'2011-01-19'),
 (u'James Cameron', u'Avatar', 5, u'2011-01-20'),
 (u'Mike Anderson', u'Gone with the Wind', 3, u'2011-01-09'),
 (u'Sarah Martinez', u'Gone with the Wind', 2, u'2011-01-22'),
 (u'Sarah Martinez', u'Gone with the Wind', 4, u'2011-01-27')]

## For all cases where the same reviewer rated the same movie twice and gave it a higher rating the second time, return the reviewer's name and the title of the movie.

In [9]:
%%sql
Select name, Movie.title
FROM Reviewer
INNER JOIN Rating on Reviewer.rID = Rating.rID
INNER JOIN Movie on Rating.mID = Movie.mID
WHERE stars IN 
  (SELECT DISTINCT MAX(stars) AS stars
   FROM Reviewer
   INNER JOIN Rating on Reviewer.rID = Rating.rID
   INNER JOIN Movie on Rating.mID = Movie.mID
   GROUP BY name, Movie.title
   HAVING COUNT(Movie.title) > 1)
AND ratingDate IN
  (SELECT DISTINCT MAX(ratingDate) AS ratingDate
   FROM Reviewer
   INNER JOIN Rating on Reviewer.rID = Rating.rID
   INNER JOIN Movie on Rating.mID = Movie.mID
   GROUP BY name, Movie.title
   HAVING COUNT(Movie.title) > 1);

Done.

[(u'Sarah Martinez', u'Gone with the Wind')]

## For each movie that has at least one rating, find the highest number of stars that movie received. Return the movie title and number of stars. Sort by movie title.

In [10]:
%%sql
SELECT Movie.title, MAX(stars) AS stars
FROM Reviewer
INNER JOIN Rating on Reviewer.rID = Rating.rID
INNER JOIN Movie on Rating.mID = Movie.mID
GROUP BY Movie.title
ORDER BY Movie.title ASC;

Done.

[(u'Avatar', 5),
 (u'E.T.', 3),
 (u'Gone with the Wind', 4),
 (u'Raiders of the Lost Ark', 4),
 (u'Snow White', 5),
 (u'The Sound of Music', 3)]

## For each movie, return the title and the 'rating spread', that is, the difference between highest and lowest ratings given to that movie. Sort by rating spread from highest to lowest, then by movie title.

In [11]:
%%sql
SELECT Movie.title, MAX(stars) - MIN(stars) AS stars
FROM Reviewer
INNER JOIN Rating on Reviewer.rID = Rating.rID
INNER JOIN Movie on Rating.mID = Movie.mID
GROUP BY Movie.title
ORDER BY stars DESC;

Done.

[(u'Avatar', 2),
 (u'Gone with the Wind', 2),
 (u'Raiders of the Lost Ark', 2),
 (u'E.T.', 1),
 (u'Snow White', 1),
 (u'The Sound of Music', 1)]

## Find the difference between the average rating of movies released before 1980 and the average rating of movies released after 1980. (Make sure to calculate the average rating for each movie, then the average of those averages for movies before 1980 and movies after. Don't just calculate the overall average rating before and after 1980.)

In [12]:
%%sql
SELECT AVG(starsbefore1980) - AVG(starsafter1980)
FROM 
(
 SELECT title, AVG(stars) AS starsbefore1980, year
 FROM Movie
 INNER JOIN Rating on Movie.mID = Rating.mID
 GROUP BY title
 HAVING year < 1980
)
,
(
 SELECT title, AVG(stars) AS starsafter1980, year
 FROM Movie
 INNER JOIN Rating on Movie.mID = Rating.mID
 GROUP BY title
 HAVING year >= 1980
);

Done.

[(0.0555555555555558,)]

# SQL Movie-Rating Modification Exercises

## Add the reviewer Roger Ebert to your database, with an rID of 209.

In [13]:
%%sql
insert into Reviewer values(209, 'Roger Ebert');

1 rows affected.

[]

## Insert 5-star ratings by James Cameron for all movies in the database. Leave the review date as NULL.

In [14]:
%%sql
insert into rating

SELECT 207, mID, 5 , null
FROM Movie 
WHERE mID IN (SELECT mID FROM Movie);

8 rows affected.

[]

## For all movies that have an average rating of 4 stars or higher, add 25 to the release year. (Update the existing tuples; don't insert new tuples.)

In [15]:
%%sql
update movie
set year = year + 25
where mID in (
  select mID from (
  select AVG(stars) as astar, mID from Rating
  where mID=rating.mID
  group by mID
  having astar >=4)
)

4 rows affected.

[]

## Remove all ratings where the movie's year is before 1970 or after 2000, and the rating is fewer than 4 stars.

In [16]:
%%sql
delete from rating
where mID in (select mID from movie where year <1970 or year > 2000)
and stars < 4;

5 rows affected.

[]

# SQL Social-Network Query Exercises

## Creating the Tables of Highschooler, Friend and Likes

In [17]:
%%sql
/* Delete the tables if they already exist */
drop table if exists Highschooler;
drop table if exists Friend;
drop table if exists Likes;

/* Create the schema for our tables */
create table Highschooler(ID int, name text, grade int);
create table Friend(ID1 int, ID2 int);
create table Likes(ID1 int, ID2 int);

/* Populate the tables with our data */
insert into Highschooler values (1510, 'Jordan', 9);
insert into Highschooler values (1689, 'Gabriel', 9);
insert into Highschooler values (1381, 'Tiffany', 9);
insert into Highschooler values (1709, 'Cassandra', 9);
insert into Highschooler values (1101, 'Haley', 10);
insert into Highschooler values (1782, 'Andrew', 10);
insert into Highschooler values (1468, 'Kris', 10);
insert into Highschooler values (1641, 'Brittany', 10);
insert into Highschooler values (1247, 'Alexis', 11);
insert into Highschooler values (1316, 'Austin', 11);
insert into Highschooler values (1911, 'Gabriel', 11);
insert into Highschooler values (1501, 'Jessica', 11);
insert into Highschooler values (1304, 'Jordan', 12);
insert into Highschooler values (1025, 'John', 12);
insert into Highschooler values (1934, 'Kyle', 12);
insert into Highschooler values (1661, 'Logan', 12);

insert into Friend values (1510, 1381);
insert into Friend values (1510, 1689);
insert into Friend values (1689, 1709);
insert into Friend values (1381, 1247);
insert into Friend values (1709, 1247);
insert into Friend values (1689, 1782);
insert into Friend values (1782, 1468);
insert into Friend values (1782, 1316);
insert into Friend values (1782, 1304);
insert into Friend values (1468, 1101);
insert into Friend values (1468, 1641);
insert into Friend values (1101, 1641);
insert into Friend values (1247, 1911);
insert into Friend values (1247, 1501);
insert into Friend values (1911, 1501);
insert into Friend values (1501, 1934);
insert into Friend values (1316, 1934);
insert into Friend values (1934, 1304);
insert into Friend values (1304, 1661);
insert into Friend values (1661, 1025);
insert into Friend select ID2, ID1 from Friend;

insert into Likes values(1689, 1709);
insert into Likes values(1709, 1689);
insert into Likes values(1782, 1709);
insert into Likes values(1911, 1247);
insert into Likes values(1247, 1468);
insert into Likes values(1641, 1468);
insert into Likes values(1316, 1304);
insert into Likes values(1501, 1934);
insert into Likes values(1934, 1501);
insert into Likes values(1025, 1101);

Done.
Done.
Done.
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
20 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

## Find the names of all students who are friends with someone named Gabriel.

In [18]:
%%sql
SELECT name
FROM Highschooler
INNER JOIN Friend on Highschooler.ID = Friend.ID1
WHERE ID2 IN
(
 SELECT ID
 FROM Highschooler
 WHERE name = 'Gabriel'
)

Done.

[(u'Jordan',), (u'Alexis',), (u'Cassandra',), (u'Andrew',), (u'Jessica',)]

## For every student who likes someone 2 or more grades younger than themselves, return that student's name and grade, and the name and grade of the student they like.

In [19]:
%%sql
SELECT tb.name_id1, tb.grade_id1, Highschooler.name, Highschooler.grade
FROM (
 SELECT name AS name_id1, grade AS grade_id1,ID2
 FROM Likes
 LEFT JOIN Highschooler ON Likes.ID1 = Highschooler.ID) AS tb
LEFT JOIN Highschooler ON tb.ID2 = Highschooler.ID
WHERE grade_id1 - grade >= 2;

Done.

[(u'John', 12, u'Haley', 10)]

## For every pair of students who both like each other, return the name and grade of both students. Include each pair only once, with the two names in alphabetical order.

In [20]:
%%sql

SELECT tb.name_id1, tb.grade_id1, Highschooler.name, Highschooler.grade
FROM (
 SELECT name AS name_id1, grade AS grade_id1,ID2
 FROM (
  SELECT ID1, ID2
  FROM Likes L1
  WHERE  ID1 > ID2
  AND EXISTS(SELECT *
                  FROM   Likes L2
                  WHERE  L1.ID1 = L2.ID2
                         AND L2.ID1 = L1.ID2)) AS Like
 LEFT JOIN Highschooler ON Like.ID1 = Highschooler.ID) AS tb
LEFT JOIN Highschooler ON tb.ID2 = Highschooler.ID

Done.

[(u'Cassandra', 9, u'Gabriel', 9), (u'Kyle', 12, u'Jessica', 11)]

In [21]:
%%sql
SELECT tb.name_id1, tb.grade_id1, Highschooler.name, Highschooler.grade
FROM (
 SELECT name AS name_id1, grade AS grade_id1,ID2
 FROM (
  Select L1.ID1, L1.ID2
  from Likes L1
  where exists (
    select 1
    from Likes L2
    where L1.ID1 = L2.ID2 and L1.ID2 = L2.ID1)) AS Like
 LEFT JOIN Highschooler ON Like.ID1 = Highschooler.ID) AS tb
LEFT JOIN Highschooler ON tb.ID2 = Highschooler.ID  
WHERE name_id1 = 'Cassandra' or name_id1 = "Jessica"

Done.

[(u'Cassandra', 9, u'Gabriel', 9), (u'Jessica', 11, u'Kyle', 12)]

## Find all students who do not appear in the Likes table (as a student who likes or is liked) and return their names and grades. Sort by grade, then by name within each grade.

In [22]:
%%sql
SELECT name, grade
FROM Highschooler
WHERE ID NOT IN (
 SELECT ID1
 FROM Likes
 UNION 
 SELECT ID2
 FROM Likes
)

Done.

[(u'Jordan', 9), (u'Tiffany', 9), (u'Logan', 12)]

## For every situation where student A likes student B, but we have no information about whom B likes (that is, B does not appear as an ID1 in the Likes table), return A and B's names and grades.

In [23]:
%%sql
SELECT tb.name_id1, tb.grade_id1, Highschooler.name, Highschooler.grade
FROM (
 SELECT name AS name_id1, grade AS grade_id1,ID2
 FROM (
  Select ID1, ID2
  FROM Likes 
  WHERE ID2 NOT IN (
    SELECT ID1
    FROM Likes )) AS Like
 LEFT JOIN Highschooler ON Like.ID1 = Highschooler.ID) AS tb
LEFT JOIN Highschooler ON tb.ID2 = Highschooler.ID

Done.

[(u'Alexis', 11, u'Kris', 10),
 (u'Brittany', 10, u'Kris', 10),
 (u'Austin', 11, u'Jordan', 12),
 (u'John', 12, u'Haley', 10)]

## Find names and grades of students who only have friends in the same grade. Return the result sorted by grade, then by name within each grade.

In [24]:
%%sql
SELECT name, grade
FROM Highschooler
WHERE ID NOT IN ( 
 SELECT ID1
 FROM (
  SELECT name AS name_id1, grade AS grade_id1,ID1,ID2
  FROM Friend
  LEFT JOIN Highschooler ON Friend.ID1 = Highschooler.ID) AS tb
 LEFT JOIN Highschooler ON tb.ID2 = Highschooler.ID
 WHERE grade_id1 <> grade)
ORDER BY grade, name ASC;

Done.

[(u'Jordan', 9),
 (u'Brittany', 10),
 (u'Haley', 10),
 (u'Kris', 10),
 (u'Gabriel', 11),
 (u'John', 12),
 (u'Logan', 12)]

## For each student A who likes a student B where the two are not friends, find if they have a friend C in common (who can introduce them!). For all such trios, return the name and grade of A, B, and C.

In [25]:
%%sql
SELECT distinct H1.Name, H1.Grade, H2.Name, H2.Grade, H3.name, H3.grade

from Highschooler H1, Highschooler H2, Highschooler H3

where H3.ID in (select Friend.ID2 from Friend where Friend.ID1 = H1.ID)
and H3.ID in (select Friend.ID2 from Friend where Friend.ID1 = H2.ID)
and H2.ID in (select Likes.ID2 from Likes where Likes.ID1 = H1.ID)
and H2.ID not in (select Friend.ID2 from Friend where Friend.ID1 = H1.ID);

Done.

[(u'Andrew', 10, u'Cassandra', 9, u'Gabriel', 9),
 (u'Austin', 11, u'Jordan', 12, u'Andrew', 10),
 (u'Austin', 11, u'Jordan', 12, u'Kyle', 12)]

## Find the difference between the number of students in the school and the number of different first names.

In [26]:
%%sql
SELECT COUNT(*)- COUNT(DISTINCT(name))
FROM Highschooler;

Done.

[(2,)]

## Find the name and grade of all students who are liked by more than one other student.

In [27]:
%%sql
SELECT name, grade
FROM Highschooler
WHERE ID IN (
 SELECT ID2
 FROM Likes
 GROUP BY ID2
 HAVING COUNT(*) > 1);

Done.

[(u'Cassandra', 9), (u'Kris', 10)]

# SQL Social-Network Modification Exercises

## It's time for the seniors to graduate. Remove all 12th graders from Highschooler.

In [28]:
%%sql
delete
FROM Highschooler
WHERE grade = 12

4 rows affected.

[]

## If two students A and B are friends, and A likes B but not vice-versa, remove the Likes tuple.

In [29]:
%%sql
DELETE FROM likes
where exists (select 1 from friend where friend.id1 = likes.id1 and friend.id2=likes.id2)
and not exists (select 1 from likes as L2 where L2.id1 = likes.id2 and L2.id2=likes.id1)

2 rows affected.

[]

## For all cases where A is friends with B, and B is friends with C, add a new friendship for the pair A and C. Do not add duplicate friendships, friendships that already exist, or friendships with oneself. (This one is a bit challenging; congratulations if you get it right.)

In [30]:
%%sql
insert into Friend (id1, id2)
select DISTINCT i1, i2 from (
  select F1.id1 as i1, F2.id2 as i2
  from friend F1  join friend F2 on F1.id2 = F2.id1
) as t
where t.i1 != t.i2
and not exists (select 1 from Friend where id1=i1 and id2=i2)
and not exists (select 1 from Friend where id2=i1 and id1=i2)

54 rows affected.

[]